package Entities;

import java.util.ArrayList;
import java.util.List;
/**
 *
 * @author gbwd
 */
public class Data {    
    static String[] names = {"Аким","Александр","Алексей","Анатолий","Андрей","Антон","Аркадий","Арсений","Артём","Артемий",
        "Богдан","Богдан","Борис","Борислав"};
    static List<String> namesList = new ArrayList();
    static List<String> surnamesList = new ArrayList();
    static List<String> patronymicsList = new ArrayList();
    
    public static List<String> getNames(){
        return toList(namesList, names);
    }
    
    public static List<String> getSurnames(){
        return toList(surnamesList, surnames);
    }
    
    public static List<String> getPatronymics(){
        return toList(patronymicsList, patronymics);
    }
    
    static String surnamesStr = "Иванов\n" +
    "Васильев\n" +
    "Петров\n" +
    "Смирнов\n" +
    "Михайлов\n" +
    "Фёдоров\n" +
    "Соколов\n" +
    "Яковлев\n" +
    "Попов\n" +
    "Андреев\n" +
    "Алексеев\n" +
    "Александров\n" +
    "Лебедев\n" +
    "Григорьев\n" +
    "Степанов\n" +
    "Семёнов\n" +
    "Павлов\n" +
    "Богданов\n" +
    "Николаев\n" +
    "Дмитриев\n" +
    "Егоров\n" +
    "Волков\n" +
    "Кузнецов\n" +
    "Никитин\n" +
    "Соловьёв\n" +
    "Тимофеев\n" +
    "Орлов\n" +
    "Афанасьев\n" +
    "Филиппов\n" +
    "Сергеев\n" +
    "Захаров\n" +
    "Матвеев\n" +
    "Виноградов\n" +
    "Кузьмин\n" +
    "Максимов\n" +
    "Козлов\n" +
    "Ильин\n" +
    "Герасимов\n" +
    "Марков\n" +
    "Новиков\n" +
    "Морозов";
    
    static String[] surnames = surnamesStr.split("\n");
     static String patronymicStr = "Ааронович\n" +
    "Абрамович\n" +
    "Августович\n" +
    "Авдеевич\n" +
    "Аверьянович\n" +
    "Адамович\n" +
    "Адрианович\n" +
    "Аксёнович\n" +
    "Александрович\n" +
    "Алексеевич\n" +
    "Анатольевич\n" +
    "Андреевич\n" +
    "Анисимович\n" +
    "Антипович\n" +
    "Антонович\n" +
    "Ануфриевич\n" +
    "Арсенович\n" +
    "Арсеньевич\n" +
    "Артёмович\n" +
    "Артемьевич\n" +
    "Артурович\n" +
    "Архипович\n" +
    "Афанасьевич\n" +
    "Бенедиктович\n" +
    "Богданович\n" +
    "Бориславич\n" +
    "Бориславович\n" +
    "Борисович\n" +
    "Брониславович\n" +
    "Валентинович\n" +
    "Валерианович\n" +
    "Валерьевич\n" +
    "Валерьянович\n" +
    "Васильевич\n" +
    "Венедиктович\n" +
    "Викентьевич\n" +
    "Викторович\n" +
    "Виленович\n" +
    "Вилорович\n" +
    "Витальевич\n" +
    "Владиленович\n" +
    "Владиславович\n" +
    "Владленович\n" +
    "Власович\n" +
    "Всеволодович\n" +
    "Вячеславович\n" +
    "Гавриилович\n" +
    "Гаврилович\n" +
    "Геннадиевич\n" +
    "Георгиевич\n" +
    "Герасимович\n" +
    "Германович\n" +
    "Гертрудович\n" +
    "Глебович\n" +
    "Гордеевич\n" +
    "Григорьевич\n" +
    "Гурьевич\n" +
    "Давидович\n" +
    "Давыдович\n" +
    "Даниилович\n" +
    "Данилович\n" +
    "Демидович\n" +
    "Демьянович\n" +
    "Денисович\n" +
    "Димитриевич\n" +
    "Дмитриевич\n" +
    "Дорофеевич\n" +
    "Евсеевич\n" +
    "Евстигнеевич\n" +
    "Егорович\n" +
    "Елизарович\n" +
    "Елисеевич\n" +
    "Еремеевич\n" +
    "Ермилович\n" +
    "Ермолаевич\n" +
    "Ерофеевич\n" +
    "Ефимович\n" +
    "Ефимьевич\n" +
    "Ефремович\n" +
    "Ефстафьевич\n" +
    "Жанович\n" +
    "Жоресович\n" +
    "Захарьевич\n" +
    "Зиновьевич\n" +
    "Игнатович\n" +
    "Игнатьевич\n" +
    "Игоревич\n" +
    "Измаилович\n" +
    "Изотович\n" +
    "Иларионович\n" +
    "Ильич\n" +
    "Ильясович\n" +
    "Иосипович\n" +
    "Иосифович\n" +
    "Исидорович\n" +
    "Марсович\n" +
    "Матвеевич\n" +
    "Тарасович\n" +
    "Теймуразович\n" +
    "Терентьевич\n" +
    "Тимурович\n" +
    "Тихонович\n" +
    "Трифонович\n" +
    "Трофимович\n" +
    "Устинович\n" +
    "Фадеевич\n" +
    "Фёдорович\n" +
    "Федосеевич\n" +
    "Федосьевич\n" +
    "Федотович\n" +
    "Феликсович\n" +
    "Феодосьевич\n";
    static String[] patronymics = patronymicStr.split("\n");
    
    static List<String> toList(List<String> list, String[] s){
        for (int i = 0; i < s.length; i++){
            list.add(s[i]);
        }
        return list;
    }

}
